<details>
  <summary>Apply for **RedVentures/rvbr-terraform-digger#dev**</summary>

  ```terraform
Terraform will perform the following actions:

  # module.digger_test[0].data.aws_iam_policy_document.default_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "default_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "public-read",
                  + "public-read-write",
                  + "authenticated-read",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "*http://acs.amazonaws.com/groups/global/AllUsers*",
                  + "*http://acs.amazonaws.com/groups/global/AuthenticatedUsers*",
                ]
              + variable = "s3:x-amz-grant-read"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutBucketAcl",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "public-read",
                  + "public-read-write",
                  + "authenticated-read",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutBucketAcl",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "*http://acs.amazonaws.com/groups/global/AllUsers*",
                  + "*http://acs.amazonaws.com/groups/global/AuthenticatedUsers*",
                ]
              + variable = "s3:x-amz-grant-read"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutEncryptionConfiguration",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.digger_test[0].aws_s3_bucket.bucket[0] will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "digger-test-dev-us-east-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application"     = "digger-test"
          + "AssetTag"        = "n/a"
          + "Backup"          = "n/a"
          + "Classification"  = "Internal"
          + "Environment"     = "dev"
          + "Expiration"      = "n/a"
          + "Name"            = "digger-test-dev-us-east-1"
          + "Owner"           = "falcantara@redventures.com"
          + "Partner"         = "platform"
          + "Project"         = "digger-test"
          + "Provisioner"     = "terraform://terraform-aws-s3"
          + "Service"         = "S3 Bucket"
          + "ServiceNowAppID" = "N/A"
          + "Version"         = "n/a"
        }
      + tags_all                    = {
          + "Application"     = "digger-test"
          + "AssetTag"        = "n/a"
          + "Backup"          = "n/a"
          + "Classification"  = "Internal"
          + "Environment"     = "dev"
          + "Expiration"      = "n/a"
          + "Name"            = "digger-test-dev-us-east-1"
          + "Owner"           = "falcantara@redventures.com"
          + "Partner"         = "platform"
          + "Project"         = "digger-test"
          + "Provisioner"     = "terraform://terraform-aws-s3"
          + "Service"         = "S3 Bucket"
          + "ServiceNowAppID" = "N/A"
          + "Version"         = "n/a"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = false
          + id      = "expire-all-objects"

          + expiration {
              + days = 1
            }
        }
      + lifecycle_rule {
          + enabled = false
          + id      = "expire-noncurrent-objects"

          + noncurrent_version_expiration {
              + days = 1
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

  # module.digger_test[0].aws_s3_bucket_policy.policy[0] will be created
  + resource "aws_s3_bucket_policy" "policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.digger_test[0].aws_s3_bucket_public_access_block.public_access_block[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.
module.digger_test[0].aws_s3_bucket.bucket[0]: Creating...
module.digger_test[0].aws_s3_bucket.bucket[0]: Creation complete after 2s [id=digger-test-dev-us-east-1]
module.digger_test[0].aws_s3_bucket_public_access_block.public_access_block[0]: Creating...
module.digger_test[0].data.aws_iam_policy_document.default_policy[0]: Reading...
module.digger_test[0].data.aws_iam_policy_document.default_policy[0]: Read complete after 0s [id=145650775]
module.digger_test[0].aws_s3_bucket_public_access_block.public_access_block[0]: Creation complete after 0s [id=digger-test-dev-us-east-1]
module.digger_test[0].aws_s3_bucket_policy.policy[0]: Creating...
module.digger_test[0].aws_s3_bucket_policy.policy[0]: Creation complete after 0s [id=digger-test-dev-us-east-1]

Warning: Argument is deprecated

  with module.digger_test[0].aws_s3_bucket.bucket[0],
  on modules/terraform-aws-s3/main.tf line 88, in resource "aws_s3_bucket" "bucket":
  88: resource "aws_s3_bucket" "bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 9 more similar warnings elsewhere)

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
  ```
</details>